# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'oven-sh/bun'

##
# Binaries
##
# brew 'mas' # Mac App Store manager
# brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'pkg-config'
brew 'dockutil'

##
# Development
##
brew 'git'
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'go'

brew 'node@20'
brew 'node@18'
brew 'node@16'
brew 'npm'
brew 'bun'
brew 'nvm'
brew 'neovim'
brew 'tmux'
brew 'ripgrep'

cask 'docker'
cask 'wezterm'
cask 'visual-studio-code'
cask 'vscodium'
cask 'postman'
cask 'herd'
cask 'sequel-ace'
cask 'raycast'

##
# Apps
##
cask '1password'
cask 'arc'
cask 'firefox'
cask 'zoom'
cask 'asana'
cask 'tiles'
cask 'spotify'
cask 'signal'
cask 'memory'
cask 'deepl'
cask 'element'
