# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

##
# Binaries
##
# brew 'mas' # Mac App Store manager
# brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'pkg-config'
brew 'dockutil'


##
# Development
##
brew 'git'
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nginx'

brew 'node@14'
brew 'npm'
brew 'nvm'

brew 'neovim'

cask 'docker'
cask 'iterm2'
cask 'visual-studio-code'
cask 'insomnia'
cask 'phpmon'
cask 'sequel-ace'
cask 'tableplus'
cask 'logseq'
cask 'warp'


##
# Apps
##
cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'tiles'
cask 'keka'
cask 'spotify'
