# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

##
# Binaries
##
# brew 'mas' # Mac App Store manager
# brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'pkg-config'
brew 'dockutil'


##
# Development
##
brew 'git'
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'php@8.0'
brew 'composer'
brew 'mysql'
brew 'nginx'

brew 'node@18'
brew 'node@16'
brew 'npm'
brew 'nvm'

cask 'docker'
cask 'iterm2'
cask 'visual-studio-code'
cask 'postman'
cask 'phpmon'
cask 'sequel-ace'
cask 'logseq'
cask 'raycast'


##
# Apps
##
cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'asana'
cask 'tiles'
cask 'spotify'
cask 'signal'
cask 'memory'
cask 'deepl'
cask 'element'
